function dz=houdusakexun(t,z)
m=0.1;%碗质量/kg
d=0.01;%小孔直径/m
D=0.11;%碗内径/m
D1=0.12;%碗外径/m
x1=0.01;%碗底厚度/m
D2=28.9*10^-2;%水箱内径/m
H0=0.15;%水箱内水高度m

g=9.8;%kg.m/s^2
s1=pi*D1^2/4;%碗外底面积
s2=D2^2;%水箱底面积 正方形
s=pi*D^2/4;%碗内底面积
A=pi*d^2/4;%小孔面积
rou=10^3;%水密度
C=0.08;%水阻力系数
k=0.5*C*rou;%k=1/2Crou


dz=zeros(3,1);
dz(1)=z(2);
%z(3)=h;
H=(s2*H0-s1*z(1)-s*z(3))/(s2-s1);
m1=rou*pi*s1*(H-z(1))/4;
dz(3)=(A/s)*(4*g*(H-z(1)-z(3)))^0.5;%h-x
dz(2)=-((rou*pi*s1*(H-z(1))/4+m)*g/(m1+m)-k*z(2)^2*(s1-A)/(m1+m)-rou*g*s1*(H-z(1)-z(3))/(m+m1));%总式


